{
    "verdict": [
        "This beautiful second edition of the classic birding guide features nearly 7,000 digitally remastered paintings."
    ],
    "pros": [
        [
            "Second edition of the classic guide",
            "Changes include 600 new paintings, 700 updated range maps, and a revised taxonomic order",
            "Almost 7,000 digitally remastered paintings in all, including illustrations of 115 rare species",
            "Flexibound format",
            "624 pages"
        ]
    ],
    "cons": [
        [
            "Some buyers had issues with with the printing of this edition, citing fonts that are too small/light and illustration colors that are too saturated",
            "A little heavy to take into the field"
        ]
    ],
    "all_review": [
        {
            "title": "Fourth printing, December 2017",
            "text": "Just to be clear on which printing of the second edition that is sold by Amazon now (Feb 2019), it is the \"Fourth printing, December 2017\". The images are 15% to 20% larger than those of the first edition. That was accomplished by reducing the page margins and by making the text smaller. The last numbered page is 598 which is 54 pages more than my first edition. However, both editions have the same dimensions because the pages are thinner in the second edition."
        },
        {
            "title": "Hefty Guide to Birding!",
            "text": "This is a comprehensive guide to North American birds and is filled with detailed information on bird physiognomy, migration ranges, habits, etc. The illustrations on feather placement on the different parts of passerines, shorebirds, ducks, and gulls and the molt and plumage changes that birds have through the seasons is interesting It has more information than I anticipated and is a great reference book to have in my library. It is a big book, weighing approximately 3 pounds and is roughly 6 1⁄2 x 10” in size. Ideal for home use and not in the field, unless you don’t mind lugging it around. Highly Recommend!"
        },
        {
            "title": "Amazing artist",
            "text": "Saw the author of this book on one of the Sunday morning shows. Amazed by his hand sketches and paintings of the birds that he uses instead of photographs. He is truly an artist. That being said I wish they would have shown photographs of the inside pages of the book. The pictures are incredibly small as is the font. Was buying it for my mother as she is an avid birdwatcher but way too small to appreciate the art work and difficult to read for someone her age. Also shipped without packing in the box so the cover was a little beat up."
        },
        {
            "title": "Good for more experienced birders, Peterson for beginners through experienced.",
            "text": "This guide has become very popular among birders with it's comprehensive phots and excellent written materials. However, I removed one star because it is not the best guide for newer birdwatchers because a photo is of one specimen at one moment in time. Newer bird observers need to know what DISTINGUISHES the species: a red spot, size of a robin, central spot on striped breast etc. For that, the Peterson guide is much better."
        },
        {
            "title": "GREAT BOOK FOR ADVANCED BIRD WATCHERS",
            "text": "This book is by one of the foremost birders in the country. The pictures and photos are wonderful for ADVANCED BIRDERS THAT LOOK AT BIRDS IN THE FIELD. If you are just starting out in the field or most especially, a person who enjoys looking at birds that come to feeders in your backyard, this book is not for you. There are bird books that Amazon carries that will serve these needs nicely."
        },
        {
            "title": "Excellent Book for Beginners & More Seasoned Birders",
            "text": "This is a great book for beginning bird watchers (as I have been). It's also the \"go to\" book for my friend who's been an active bird watcher for over 20 years. It has great photos of various stages/activity, as well as other pertinent information in efficient, organized manner. I can highly recommend this book."
        },
        {
            "title": "Sibley Guide Defective",
            "text": "This book is defective in that the colors and print is substandard. For example the Scarlet Tanager photo is faded out. The publisher Kropf has reprinted the book so this defective book should be replaced at no cost. Update: I brought this to the attention of Amazon via telephone and they sent me a copy of the 2nd printing which is much better. Very good customer service that was quite responsive."
        },
        {
            "title": "The Sibley Guide to Birds, 2nd Edition",
            "text": "I find this book to be excellent for use by a beginner or an expert. Part of it is that it uses illustrations rather than photographs, books with photographs show one picture for a bird, this book has many illustrations of a bird, male, female, juvenile, adult, and breeding adult and in many cases variations on the coloring scheme. This makes it easier for a beginer to be able to identify a particular bird. There are chart on the places and seasons that the particular bird is available, as well as dimensions, and information on the bird. I would highly recommend this book to a beginner."
        },
        {
            "title": "For many years the Peterson guides to the birds (eastern ...",
            "text": "For many years the Peterson guides to the birds (eastern and western) were the standard of excellence for bird watchers. They have new been replaced by David Sibley's guide, which is much more comprehensive. Sibley's guide includes pictures of each species in all its plumages--male (breeding and non-breeding), female, and juvenile, with any regional variations being shown as well. A map showing the ranges (winter, migrating, and summer) is given for each bird. A comprehensive index is provided. Our copy is well-worn from use and greatly appreciated."
        },
        {
            "title": "Legendary book-epic reference for everyone from casual avian observer to seasoned birder!",
            "text": "There’s almost nothing I can add to enhance the reputation of this legendary book! Sibley books are not just informative with beautiful illustrations, but have become the gold standard for learning about and identifying birds. So great I purchased it twice - once for myself & once for my son. Bravo Sibleys!"
        },
        {
            "title": "THE BEST Field Guide you can buy for USA/Canada",
            "text": "Just ordered this a couple/few years after the 2nd edition came out with negative reception due to printing/ink errors. Just ordered September 2017 (2nd printing) and I must say, this is hands down THE best bird field guide for North America. The major shortcomings in Sibley 1.0 were primarily the crappy maps, followed by lack of text. This edition has amazingly accurate and more detailed maps, vastly improved (doubled+) the amount of informative text, and even improves on paintings of many species. THE BEST FIELD GUIDE FOR USA/CANADA PERIOD."
        },
        {
            "title": "Best book for identifying birds and learning about birds.",
            "text": "I've bought five books for identifying and learning about birds. This one reigns supreme. The details in the illustrations and the facts are fantastic. Information about all the variations, juveniles, etc. are included. I was able to identify a bird the first day I had it that I couldn't id with any of my other books. It was recommended to me by a birder expert as the best and I agree."
        },
        {
            "title": "Top of the field",
            "text": "A revelation, and an absolute must for birding. Short of having all the world's best birders beside you, this comes as close as anything to representing the variety that individual birds within a species present in the field -- making identification far more manageable than any other guides. That you can also use the more portable Field Guide (albeit with a bit less info at your fingertips) version and the phone/tablet app (which includes representative bird songs) makes it a hard to beat option for anyone interested in birds."
        },
        {
            "title": "Benchmark Bird Guide",
            "text": "Comprehensive and well illustrated. This is the go-to guide for North American birding. Please note publication date is December 2017 and any issues with font and plate coloration are resolved in this printing."
        },
        {
            "title": "this is a great birding guide to have",
            "text": "Don't get me wrong, this is a great birding guide to have, but be sure to get the second edition-SECOND PRINTING of this guide. The colors are more true and the text is easier to read than the first printing. I took a risk and received the first printing from amazon while others received the SECOND PRINTING of the second edition. There is no way to tell what printing you will receive from amazon and I lost. It has been returned. I just wish amazon could be more specific as to which printing customers will get. No way of knowing"
        },
        {
            "title": "Excellent birding reference",
            "text": "Good home reference, but I wish that by buying this book, that I would have had free access to the app which is much more convenient when out in the field birding."
        },
        {
            "title": "The Reference for all birders",
            "text": "Very important for new and experienced birders. I noticed many of the \"old-timers\" still using Sibleys as I was just starting. This is a HUGE step above the average bird ID book. This reference is a good value. I also bought the condensed smaller version to carry in the field."
        },
        {
            "title": "Amazing masterpiece. The variety of plumage variations is astounding ...",
            "text": "Amazing masterpiece. The variety of plumage variations is astounding and very helpful when identifying birds. Although some may claim that it's too big - it really isn't. It's a very reasonable size for the amount of material included. The little descriptions are short but usually contain the important information necessary to distinguish from similar species. I would highly recommend this book to anyone. Much easier than using apps such as iBird."
        },
        {
            "title": "Indispensable.",
            "text": "I bought a couple copies for gifts, and realized how dull my first edition had become when compared to this terrific printing. These were from the fourth printing from December of 2017. It's not something most people would haul out in the field, but it's wonderful to keep handy around the house."
        },
        {
            "title": "Great gift",
            "text": "Gave this to a coworker who was going to be stuck at home recouperating from surgery and has a lot of birds in her yard. I now receive regular reports of bird sightings. I own it myself and appreciate the explanation/description of subtle differences between species."
        },
        {
            "title": "Best in Birds",
            "text": "Wow ! This book is a must for birding fans. Great pics and descriptions. Love it! Bought another to give as a gift. Perfecct gift for anyone with a bird enthusiast in their family."
        },
        {
            "title": "Don't Throw Your 1st Edition Away",
            "text": "The 2nd edition finally arrived! I was so excited, but then I opened the book and gasped. So much had been made of the revised text, however, the publisher neglected to warn potential buyers that actually reading the text would be a challenge. A big challenge! The font size is tiny, thin, and the ink appears gray. It is just terrible. The color of the birds seem off--often too brightly colored or too dark. Inclusion of additional species is most welcome though."
        },
        {
            "title": "Love this book!",
            "text": "A couple of years ago I had purchased the first edition of this book. I wasn't sure whether I really wanted to spend the money on the second edition but I'm so glad I did. I LOVED the first edition but this one is even better. It seems like there are a lot more pictures and I have been able to identify some birds that I wasn't able to identify with the first edition so I'm definitely glad I made the investment!"
        },
        {
            "title": "This is a good book for birders",
            "text": "This is a good book for birders. It gives a lot of information and drawings to identify birds; even the ones that are only seen briefly. I like that it shows birds in their larger families and lists birds in the index by their common names."
        },
        {
            "title": "Excellent reference book.",
            "text": "Wonderful photos and extensive data about lots of birds. When we can't identify one at our feeder, we go to this reference and almost always get the answer. We're glad we invested in this one."
        },
        {
            "title": "Good if you don't have original version. Not so other wise.",
            "text": "Still comparing it to 1st addiction. Like the maps better in old version but bigger pictures in new ok. So far I'm thinking that this version is good if one doesn't have the first addition. Otherwise save your money."
        },
        {
            "title": "Very Useful Book",
            "text": "This book lives up to it's reputation of being an excellent bird book. I especially like all the extra images of immature birds, silhouette, similar birds groupings."
        },
        {
            "title": "Fabulous book",
            "text": "What a great book! Like the other reviews, it is heavy--really a coffee table book that can be grabbed to check out an unknown visitor. It's cherished."
        },
        {
            "title": "Absolutely wonderful",
            "text": "I got this for my wife (27). She loves it. I got lucky in receiving the second printing (I didn't try anything special like researching the sellers, etc, I just clicked \"buy\" here on Amazon, I have no clue who the seller was). This is my wife's first ever bird book (mine too) and we love it. We like the organization and the images and the whole thing is great."
        },
        {
            "title": "need to know the name of the bird to be able to look it up",
            "text": "I had to download a bird ID app to be able to figure out how to look up the bird, but once there, it tells you everything you need to know about the bird."
        },
        {
            "title": "Gift for My Wife",
            "text": "My wife loves birds and loved this authoritative book. Unfortunately, the seller did not pack it well and it arrived with creases in the cover. Such a shame."
        },
        {
            "title": "Best bird ID book EVER!",
            "text": "This is easily the best bird ID book I've ever owned, and I say this as an ornithologist (bird scientist). Contains pretty much everything you need to ID North American bird species."
        },
        {
            "title": "Cognitive dissonance, i.e. buyer's remorse!",
            "text": "As a happy owner of Sibley's first guide (as well as the regionalized East and West versions and his Behavior volume), I didn't hesitate to take the plunge on the 2nd edition. I didn't spend much time with the new one, as other things were taking me away from birding, but as I geared up for the May migration season, I became aware of the font and printing issues. Now I am hopeful of getting my original purchase replaced in September. Still a great book, but if the visuals are compromised, and the reading difficult, it's at most a 3-star offering."
        },
        {
            "title": "bird watchers must have",
            "text": "helps with what you are looking for with different species and gives different views and discriptions, not a pocket version to take into the field"
        },
        {
            "title": "Worthwhile",
            "text": "Saw a piece about David Sibley on CBS Sunday Morning. Fantastic. Just had to get the book for my husband.. The variety of birds is unbelievable. A great source of information."
        },
        {
            "title": "Comprehensive, pretty, and unparalleled: Sibley is My Go-to Field Guide",
            "text": "This is a lifetime labor of love presented to us by a man who has dedicated his life to teaching birds and trees to people with an easy to follow but highly comprehensive approach. Each year I've used the Sibley Guide to Birds I've been more and more impressed. Sibley provides an unparalleled encyclopedia of plumages with concise and expert tips and maps for each species. The voice descriptions are excellent as well. I enjoy consulting other field guides, but this is my go-to guide. Sibley is the modern-day guru of bird ID in North America and this second edition presents his illustrations in a larger format than the previous edition, along with added illustrations and of course updates."
        },
        {
            "title": "Best bird book I have ever found.",
            "text": "I've had this book for more than 20 years. I won't trade it for any other bird book. I also have his books to the eastern and western bird guides which are smaller than this one."
        },
        {
            "title": "Probably a great book if you are an experienced bird watcher",
            "text": "Not very user friendly especially if you are a novice. Coloration of the birds are not close to real life. Probably a great book if you are an experienced bird watcher. Was too difficult for us to find and identify birds."
        },
        {
            "title": "lovely illustrations and strong information",
            "text": "My husband requested a copy of this book after seeing it reviewed on television. I am delighted with the quality and amazing illustrations. he will enjoy it for years to come!"
        },
        {
            "title": "Worth the $..",
            "text": "It is like a College Text.. Tells U all U need 2 know.. My go to is Still \"Large print Peterson - Eastern\".."
        },
        {
            "title": "Excellent Guide to Birding",
            "text": "Wonderful reference guide for the backyard birdwatcher and a must in the library of the dedicated bird-lover!"
        },
        {
            "title": "My new favorite bird book",
            "text": "Possibly the best bird book in print. Of the 8 that I own, this is my new go to for bird reference."
        },
        {
            "title": "More information than other bird books.",
            "text": "Books a bit large for the field but includes much useful information for backyard birding that I do."
        },
        {
            "title": "Good for any level birder",
            "text": "I bought this for my father, but wanted to keep it! Well organized, good for birders at any level."
        },
        {
            "title": "Great",
            "text": "I bought this book as well as the National Geographic field guide. Both are great but I slightly prefer this book from Sibley. I feel like it provides slightly more information and I like the layout"
        },
        {
            "title": "Fantastic reference",
            "text": "Fantastic reference. My only criticism is that wingspans are listed in Imperial units rather than metric (or both)."
        },
        {
            "title": "The Wife Loves It",
            "text": "Expert descriptions about a wide variety of our winged friends. Best we've seen."
        },
        {
            "title": "Outstanding!",
            "text": "As a life-long bird watcher, my wife was amazed at the detail and realistic appearance of Sibley's illustrations. She feels he has brought a new aesthetic to the world of birds...."
        },
        {
            "title": "We loved it so much we bought another one for convenience",
            "text": "Even if you only occasionally wonder what bird you are looking at, this book is well worth the price. We loved it so much we bought another one for convenience. Makes a great gift for anyone who feeds and watches birds."
        },
        {
            "title": "Wonderful resource book",
            "text": "Wonderful book. Arrived damaged. No time to return as it is a gift"
        },
        {
            "title": "Great birder book",
            "text": "Bit beat up that’s why it was a cheeper price, that was a pun"
        },
        {
            "title": "you can't beat Sibley if you want to id birds",
            "text": "I have bought Sibley's for all of my family. It gets used often. Just recently bought one as one of my granddaughter's graduation gifts"
        },
        {
            "title": "Nice Bird Book",
            "text": "Bought as a gift for an avid bird watcher. She loves it."
        },
        {
            "title": "Excellent book.",
            "text": "The book is awesome. I would have given it 5 stars but the shipping was not so good. The book cover is bent and wrinkled, and didn't show up when Amazon said it would."
        },
        {
            "title": "Fourth printing, December 2017",
            "text": "I have purchased the second printing of this second edition and I am very happy with the corrections. The richer colors add new life to Sibley's paintings,"
        },
        {
            "title": "Beautifully illustrated!",
            "text": "A am very impressed with the details of all of the illustrations in this book. The author's vast knowledge of his subject is obvious. This will be so enjoyable and educational to have in our home and to share with others as gifts."
        },
        {
            "title": "Great photos. Good information",
            "text": "Great photos. Good information. Would have given five stars but the cover was bent before it was packaged... Bad move, Amazon! Still a great book. Thick and heavy."
        },
        {
            "title": "Great for bird watchers",
            "text": "This book showed more about the birds than most. Wife has serval bird books but this is now her favorite."
        },
        {
            "title": "Love the drawings of birds in flight.",
            "text": "The picture of each bird in flight helps identify the bird in its habitat. True-to-life pictures, drawn by David Sibley, who grew up watching birds with his parents."
        },
        {
            "title": "Excellent",
            "text": "Bought this book for my wife. She’s thrilled with it. This is a very informative work, with great illustrations and a field-worthy and rugged binding. We have a lot of bird guides but this one is the best. Money well-spent."
        },
        {
            "title": "NOT A FIELD GUIDE",
            "text": "This is a good book on birds, but it is not a field guide- way too big and heavy."
        },
        {
            "title": "Requested Gift",
            "text": "Gift for my bird-watching daughter. Requested based on book reviews."
        },
        {
            "title": "simply the best",
            "text": "I received the 2nd printing of the 2nd edition from Amazon. This superb guide is finally printed as the author intended. The color issues in the 1st printing have been corrected, and the typeface is much darker & more legible. Mr. Sibley's thousands of spectacular paintings capture each species and clearly show variations in gender, plumage & position. His concise text highlights important field marks & behaviors."
        },
        {
            "title": "... and this book has made things so clear and easy to understand",
            "text": "We just started bird watching at a very casual level and this book has made things so clear and easy to understand. The pictures are very helpful and the color coded map for each bird makes it clear to see which birds are where at different times of the year."
        },
        {
            "title": "Excellent Resource for Birds",
            "text": "What a wealth of information. A birding friend of mine suggested this book. She said it's what the game wardens use."
        },
        {
            "title": "A real winner",
            "text": "A real winner; the writer is also the artist, both excellent work."
        },
        {
            "title": "Best bird book I have!  Best illustrations and info.  Was recommended as best @ B&N bookstore but got here instead.",
            "text": "I have lots of bird books, some for my region only and wide area like this covers. This is the most complete, best illustrated book I have. I love that it has juvenile illustrations to help with identifications. This book was recommended by salesperson at a B&N as being the top and I agree. I have another Sibley book and would never hesitate to buy anything David Sibley puts out."
        },
        {
            "title": "The new Sibley bird guide",
            "text": "I like the update to the latest AOU changes (though to come), but it is not always easy to delineate families. I am amazed that Sibley could produce this edition so don after publication of the AOU changes - he had to have some advanced knowledge's. Regardle, the birding community will benefit, even some may not appreciate all of the changes! Keith Arnold"
        },
        {
            "title": "Avian Identification Icon",
            "text": "This is the guide to own if you are serious about learning about North American birds. This second edition is superb."
        },
        {
            "title": "Sibley Bird Guides ... great field guides",
            "text": "The best bird field guide out there. The full edition is a bit bulky but you couldn't ask for a more comprehensive guide. A better option to take into the field would be the Sibley Birds East or Sibley Birds West as they are considerably lighter. The illustrations, ranges and descriptions are of the highest caliber. Indispensable bird watchers accessory!"
        },
        {
            "title": "Highly recommended for anybody who appreciates birds.",
            "text": "I wouldn't consider myself a birder but I live in an area where there are a lot of birds. My wife and I take a lot of photos of said birds and we needed a means to identify them quickly. This book has enabled us to do just that. It's easy to find things, the illustrations are outstanding and descriptions are short and concise."
        },
        {
            "title": "Great bird book",
            "text": "Purchased for my wife. She says it’s the nicest bird book she has ever seen!"
        },
        {
            "title": "the updated version has new features that help a lot with identifying markings on breeding plumage and subtle differences in the",
            "text": "worth the price even if you have the older version. the updated version has new features that help a lot with identifying markings on breeding plumage and subtle differences in the look of similar facial markings in like birds"
        },
        {
            "title": "Love it",
            "text": "Best bird book ever! Don't waste your money on any other."
        },
        {
            "title": "Birds Galore",
            "text": "Sibley's artistry is simply breathtaking! This volume is a \"MUST HAVE\" for anyone serious about birding!"
        },
        {
            "title": "I love it. This is my 3rd copy that I ...",
            "text": "I love it. This is my 3rd copy that I have bought. One got ruined in the rain. One got ruined in a backpack when I sweated so much because I was in a very hot area. I like it because it is so accurate and the drawings are are the best. It also will fit into the back pocket of Levis."
        },
        {
            "title": "SQ",
            "text": "Excellent source for bird identification. Also have purchased ibird Pro on my Apple app. It is a GREAT source for sound, pictures, and can locate birds in your specific area code. All good stuff for a new bird watcher!"
        },
        {
            "title": "The drawings and maps make it easy to determine what you're looking at",
            "text": "An incredible book for the avid birder. The drawings and maps make it easy to determine what you're looking at. Not a \"field guide\" but more of a reference book, just because of its size. I have bought the smaller Western version which is much easier to tote around."
        },
        {
            "title": "best bird ID book out there-bought & gave this one ...",
            "text": "best bird ID book out there-bought & gave this one to our birding friends that were still using old outdated books and missing out on great information. great book & fair price."
        },
        {
            "title": "awesome",
            "text": "love the paintings and hands down the one and only bird guide you will ever need in NA. packed with additional info to help ID difficult birds."
        },
        {
            "title": "Gorgeous artwork",
            "text": "The artwork is lovely, and the binding makes the book sturdy and easy to use."
        },
        {
            "title": "The print is so small you need a magnifying glass ...",
            "text": "The print is so small you need a magnifying glass to read it. Too much information for such a small book."
        },
        {
            "title": "Fabulous guide - and be warned it is big!",
            "text": "Wonderful guide - beautiful illustrations, easy to read and use, good comparisons between similar birds, updated ranges, and relatively easy to read. Warning, though - it IS big (check out the size) and not a pocket guide for the field. Since most of my birdwatching is done locally, I don't mind and appreciate the larger pictures and texts."
        },
        {
            "title": "Good book for handling tough ID issues",
            "text": "Good book for handling tough ID issues. The illustrations cover stages of life, seasonal plumage and both genders. This book is strictly about ID helps. To learn more about behavior and specifics about bird families and individuals, get \"Sibley Birds, bird life and behavior.\""
        },
        {
            "title": "The knowledge afforded by this book is unlimited when it comes to the rare birds of our nation.",
            "text": "I like the intricate detail of the illustrations of the birds. I will be using this book for reference as we live in a wildlife area in the north woods of Wisconsin."
        },
        {
            "title": "Expands ID when added to guides you may already use",
            "text": "Added to my other guides as it includes more color variations. Makes it easier to ID seasonal variations in colors and age."
        },
        {
            "title": "Great revised version - second printing is well done",
            "text": "A nice update from the first version with bigger illustrations, new paintings, and updated range maps. I received the second printing, which corrected the issues in the first printing. A great detailed field guide!"
        },
        {
            "title": "Favorite Field Guide",
            "text": "My favorite field guide! I think this is the 'gold standard' as far as field guides go. Every Audubon walk I've been on the leader carries Sibley's."
        },
        {
            "title": "This guide was recommended by a sculpting teacher because it lists the dimensions ...",
            "text": "This guide was recommended by a sculpting teacher because it lists the dimensions of wing spread and head to tail. At first, I ordered the older version and then decided to order the 2nd ed. I am very pleased with the Sibley Guide and used it throughout my sculpting workshop at Brookgreen Gardens."
        },
        {
            "title": "Great Book to Learn Your BIRDS!!!",
            "text": "Of all the many bird books I have, this is my go to book. Just the extra information I needed to help identify the correct species since so many look the same. Well written & put together."
        },
        {
            "title": "Perfect",
            "text": "My aunt recommend this as a bird guide. This book has great images to help with identification . the writing is top notch I have been learning a ton from this book. It is like a great text book."
        },
        {
            "title": "a great updated edition full of info and beautiful art",
            "text": "if you bird, you Sibley. a great updated edition full of info and beautiful art. the font is a little funny but that's all."
        },
        {
            "title": "Love it. Like the colors and descriptions",
            "text": "Love it. Like the colors and descriptions. Only complaint is that it is bigger than I expected, and therefore not as handy and not practical for a field guide."
        },
        {
            "title": "Good but text problem.",
            "text": "Great guide as always from Sibley but I have to agree with others who say the text is printed much too lightly. Almost a gray instead of black. Maybe that is the publishers fault? Not the author."
        },
        {
            "title": "Excellent book",
            "text": "I’ve been a casual birdwatcher since I retired 5 years ago. This book is a great resource to help identify and learn about the birds I see."
        },
        {
            "title": "Well done.",
            "text": "Very well organized with multiple illustrations of the changing colors with age, maturity, mating seasons etc. A good addition to my birding references."
        },
        {
            "title": "This is an amazing book. I might use an app to get ...",
            "text": "This is an amazing book. I might use an app to get an idea for what I am looking at, but this book has much better information, I like having drawings from multiple angles to aid identification. Much better than photographs. If only there was a way to imbed all the bird calls into the book."
        },
        {
            "title": "... the 3rd copy I've bought as a gift -- great birding guide and excellent drawings",
            "text": "This is the 3rd copy I've bought as a gift -- great birding guide and excellent drawings."
        },
        {
            "title": "Excellent",
            "text": "An excellent companion to other bird books. A definite must have!"
        },
        {
            "title": "... that the quality of pictures of the birds is poor and the font light",
            "text": "I just received information about the 2nd edition of Sibley Guide to Birds can be replaced if I purchased it from Amazon due to the fact that the quality of pictures of the birds is poor and the font light. The copy I purchased has the print date of March 2014. It is to be replaced by the July 2014 printing. I have been a good customer of Amazon and hope to receive the better quality of this guide which was printed in July 2014."
        }
    ]
}