{
    "verdict": [
        "A beautifully illustrated guide to browse through, although the lack of an identification key can make it difficult for a novice to narrow down species."
    ],
    "pros": [
        [
            "More than 600 tree species, and more than 400 range maps",
            "Arranged taxonomically, not by features",
            "High quality painted illustrations",
            "426 pages",
            "Good general information"
        ]
    ],
    "cons": [
        [
            "Some found this difficult to use, with no identification key for locating species"
        ]
    ],
    "all_review": [
        {
            "title": "Amazing book from Sibley",
            "text": "I love browsing through this book but would warn people it has the whole US so there are many trees to sort through to find ones in your area"
        },
        {
            "title": "Easy to Use",
            "text": "As a beginner learning to identify trees for the first time, this book is as user-friendly as they come. Easily read through or picked up to flip through. Sibley has taken the same simple approach to Tree ID as he did in his field guide to birds and it works."
        },
        {
            "title": "THE ROGER TORY PETERSON OF OUR TIME",
            "text": "David Allen Sibley is the Roger Tory Peterson of our time. I have become familiar with Mr. Sibley through his bird illustrations and books. He is quite simply the best illustrator of wild life and wild growth alive today in America. His intimate familiarity with the subjects he illustrates is evident in the most cursory review of his books. For the amateur interested in trees and birds, I strongly recommend his books as a guide to identification. His bird book never leaves my car and his Guide to Trees is regularly used in my library. His Hawks in Flight, written and illustrated in collaboration with Pete Dunne, is an American classic."
        },
        {
            "title": "a nice addition to tree id manuals",
            "text": "Overall, this is an excellent identification manual for trees. Though some would disagree, I'm sure, I find this is an enormous improvement over the Audubon manual, where the photos, of questionable utility, are organized into different sections (fruits, leaves, flowers, etc.). The advantage of that book is that once you make it to the text part, there's more in-depth information. With Sibley's book, everything is on one page. Another issue I have with the book is the editorializing about the value of some trees, ostensibly as street trees. And for some strange reason Sibley expresses admiration for .... Norway Maples (?!). On the other hand, he does give some information on invasives, etc."
        },
        {
            "title": "If you see a tree and want to know what it is...",
            "text": "This book will help you figure it out. Purchased on recommendation from a Dendrologist (Tree scientist) for someone who asked for a \"Really good\" Tree identification book, it does not disappoint."
        },
        {
            "title": "A Heavy Duty Guide to Identifying the Trees of North America",
            "text": "This is an authoritative and useful guide to identifying trees that you come upon in North America. That, however, often requires more than a passing glance because important distinctions are revealed by the bark, cones, and leaves. This book is so weighty that you might not want to add it to your pack for a long hike. Instead, take photos of the profile, bark and leaves of a tree that is unknown to you and then determine its identity with this guide once you have returned home."
        },
        {
            "title": "Sibley is just the best",
            "text": "This is hands down the best tree guide I’ve ever seen, I have just about all of them for Eastern North America and I doubt I’ll be opening any of the other ones again."
        },
        {
            "title": "Great for learners",
            "text": "This is a wonderful gift for nature lovers and learners. The information and illustrations are great in this book. I love all Sibley books"
        },
        {
            "title": "Love it!",
            "text": "This book gives lots of information about trees. I used it for a Dendrology class and found it to be my bible. Very educational! Great condition. Light weight, easy for use in the field."
        },
        {
            "title": "Helpful",
            "text": "This is a great guide. I've been able to use it to identify trees in my neighborhood and backyard. Good illustrations and info. Quite useful"
        },
        {
            "title": "Great book!",
            "text": "I got this as a gift for my neighbor- he LOVES it. Great pictures and beautiful details"
        },
        {
            "title": "Sibley guide to trees",
            "text": "Wow! I really like this book. It is easy to use and gives so much information to make it easier for a \"newbie\" like me to identify trees. The drawings are detailed with good descriptions. The quality of the book is great in every way. The reason I like this book better than one on trees for my section of the country is that so many times I come across a tree that is \"non-native\" to my area and it is not listed in the other tree books. This book has native trees and common trees. I have found it very useful."
        },
        {
            "title": "Great Book, damaged upon arrival. (NEW BOOK)",
            "text": "The book itself is an amazing guide to trees. Though when it arrived it it was already damaged. The upper left hand corner of the flexbound cover is torn. See image that I have left with the review for further examination. I would return for a replacement but I live 25 mins from the nearest UPS/FedEx so it's just not worth the mess nor is waiting for a pickup from them. So, clear tape will do for a fix."
        },
        {
            "title": "Amazing guide!",
            "text": "This book has a section for each family where it clearly details the hallmarks of each family and, in some cases, explains what separates that family from similar families--something missing from most field guides!"
        },
        {
            "title": "Small Fonts",
            "text": "Fonts are too small for old eyes, even with +3.00 Eyeglasses. San-Serif small fonts also compound the small font problem. Otherwise the best Guide for trees I've seen."
        },
        {
            "title": "Wonderful illustrations, informative text.",
            "text": "I have been a long time bird watcher and finally decided to give identifying trees a go. Well, if you think identifying birds is hard.. try giving a tree in winter a go! I found this a good overall introduction and it looks like I will be able to go pretty deep into before needing another guide. In other words, its a great introduction and good long term guide too. Like the Sibley bird guide its a bit heavy to bring out into the field (and both would make it a work out!) but great for prepping before you go."
        },
        {
            "title": "The One",
            "text": "The best tree I’d guide out. Perfect for arbor enthusiasts."
        },
        {
            "title": "great photos and makes it easier to identify trees",
            "text": "This was a book my husband had at work (US Fish and Wildlife) and wanted it for his own collection. Well laid out, great photos and makes it easier to identify trees."
        },
        {
            "title": "Makes identifying wood samples for my woodturnng easy.",
            "text": "Exactly what I was looking for. Needed something that I could use to identify wood species based only on short (10-20\") pieces with the bark intact. This book not only shows pictures of the bark, but also different pictures showing the young and mature barks. Makes identifying wood samples for my woodturnng easy."
        },
        {
            "title": "Excellent!  But who lives in all fifty states?",
            "text": "I have to admit that I cut out only the trees that grow in Wisconsin and then assembled them into my own book. The nature publishing industry needs to localize their printing and distribution."
        },
        {
            "title": "This is a must-have guidebook for anyone who has an ...",
            "text": "This is a must-have guidebook for anyone who has an interest in trees! It is so well organized and detailed throughout the pages."
        },
        {
            "title": "Five Stars",
            "text": "Excellent graphics of tree parts to aid in identification of USA Trees."
        },
        {
            "title": "Sibley set high standards yet again!",
            "text": "I first came to Sibley's work through his bird book several years ago, a first rate publication. I purchased his Tree book hoping he would get close to the standard he set, I think he did. Great field guide and art."
        },
        {
            "title": "What a beautiful edition!",
            "text": "Gorgeous!! I was amazed that such books no longer seem to exist for the animal and plant kingdom, and being new to this region I have been dying to identify all the trees here that we do not have out east. Love this book!"
        },
        {
            "title": "Great resource",
            "text": "I am more a birder and find Sibley's Bird Guide is fantastic. My wife and I have always been interested in trees but know very little- so when this tree guide came out I was very interested. The illustrations are great and the introductory material easy to read. I look forward to getting more comfortable with recognizing local trees. This is a valuable resource."
        },
        {
            "title": "Tree Guide can't be beat...",
            "text": "Wonderful book for the amateur or maybe even the expert. Easy to navigate, excellent illustrations. The price is a completely fair one and a good price because I know what library reference books cost and this one is a bargain yet better than several at far more."
        },
        {
            "title": "While it may be a good guide for the novice backyard naturalist",
            "text": "While it may be a good guide for the novice backyard naturalist, it's that good as a field guide."
        },
        {
            "title": "great resource",
            "text": "This is a very comprehensive resource for trees of North America--excellent photographic illustrations, well-indexed. Bought as a gift for my husband who has a forestry project on family farm land. Bit disappointed in the binding--expected a hardback, but instead it's a \"glorified paperback.\" It's fairly sturdy, but it isn't a hardback."
        },
        {
            "title": "Not Yet a Tree ID Expert?",
            "text": "Not yet a tree expert? This is the book for you. The book is beautifully illustrated, showing leaves, bark, buds, fruit, descriptions, and maps of North America where the trees grow native. My favorite field guide."
        },
        {
            "title": "Seems like a pretty solid reference guide",
            "text": "Seems like a pretty solid reference guide. I haven't really used it that much so far, but the illustrations are pretty good and the descriptions are helpful. It is also organized intuitively, making it easy to find what you're looking for."
        },
        {
            "title": "Five Stars",
            "text": "Very easy to look up different trees, I would highly recommend"
        },
        {
            "title": "A must for your bookshelf.",
            "text": "A great resource for determine the species that you are looking at. Good descriptions, good diagrams. Useful easy to use reference to area where different species are located."
        },
        {
            "title": "Know Trees Better",
            "text": "As a Oregon Master Gardener I appreciate books like this \"Sibley Guide to Trees\". In fact all Sibley guides are well done. I also have Sibley's bird guides and they too are excellent. I strongly recommend this tree guide to anyone who wants to increase their knowledge of trees."
        },
        {
            "title": "The Best",
            "text": "The classic I will always choose to share with newbie and seasoned tree-lovers alike!"
        },
        {
            "title": "This is a beautiful book. Nice layout and great illustrations",
            "text": "This is a beautiful book. Nice layout and great illustrations. I am glad I found it. A good reference book for the layman or artist."
        },
        {
            "title": "My husband loves this book,",
            "text": "This book has a lot of details if you in to the nature, my husband and me love this book since we have other books and this one give more details. We already found more trees thanks to the guide. I strongly recommend to anyone. Chis"
        },
        {
            "title": "Great guide",
            "text": "We love the thorough descriptions and drawings they really help you understand which tree it is you're looking at"
        },
        {
            "title": "happy customer",
            "text": "very quick shipping and the book was just as described - great condition. thanks!"
        },
        {
            "title": "Good book",
            "text": "I bought this for my husband who wanted a good book on trees. This one was recommended and I bought it. It was a very informative and complete book."
        },
        {
            "title": "I purchased this for my partner and they love it. The colors are vivid and it is ...",
            "text": "I purchased this for my partner and they love it. The colors are vivid and it is just small enough to take on hikes through the forest."
        },
        {
            "title": "Great book.",
            "text": "This is a great tree book. Small enough to carry in the field with you and enough information to identify trees. Illustrations are helpful."
        },
        {
            "title": "Five Stars",
            "text": "helpful for beginners and useful for more experienced tree aficionados...good illustrations!"
        },
        {
            "title": "Excellent writing and illustrations",
            "text": "As with David Allen Sibley, bird guides, his writing is clear and informative. Sibley writes in a manner that easy to understand, interesting and fun to read. And, again as with the bird guides, the illustrations of the parts of the trees aid to quicker identification when out in the field. I also like the additional information such as birds that are attracted to the trees and the human uses of different parts of trees."
        },
        {
            "title": "Superbly illustrated, eleganty designed reference -- a delight for eye and mind",
            "text": "David Sibley and his editors meld compelling illustrations and lucid text with enough white space to make this tree reference accurate, informative, and useful without overwhelming the reader. I'm using it as an adjunct text for landscaping courses, but it would work well as a reference book for the gardener, hiker, science teacher, and everyday lover of trees."
        },
        {
            "title": "Tree Huggers Will Love This Book",
            "text": "I love this book. Awesome resource, good pictures and descriptions, a great find overall."
        },
        {
            "title": "This book is amazing.",
            "text": "This book is really great. The information is well written and what's even more impressive is the author illustrated it beautifully. The illustrations are very well done."
        },
        {
            "title": "Great book!",
            "text": "This is a fantastic book with great illustrations that makes it very easy to find trees and learn more about them. Received in perfect condition and received expediently! Thank you."
        },
        {
            "title": "excellent guide",
            "text": "This is the most complete tree guide I have ever seen and recommend it to anyone who is trying to identify various species. The illustrations of the various leaf shapes, flowers, bark, maps, and other features make this guide exceptional."
        },
        {
            "title": "Sibley Guide to Trees",
            "text": "Expected informative and well-illustrated guide similar to Sibley's Guide to Birds. Expectations met. Only detraction is the size for use in the field. As with his Guide to Birds, it's rather large and heavy to carry in a cargo-sized pocket, although it's light enough for a backpack. For content, placing range maps on the same page as the descriptions instead of in an appendix is a welcomed feature."
        },
        {
            "title": "Great Book!",
            "text": "Good illustrations, worth the money, I highly recommend this book to anyone wanting to identify trees. That is all I have to say."
        },
        {
            "title": "Beautiful book",
            "text": "Bought this for an arborist. Beautifully illustrated. Chock full of great information. A worthy resource. Definitely recommend especially at this price point."
        },
        {
            "title": "another Sibley masterpiece",
            "text": "Perhaps a bit large for a pocket fiel guide, but not touted as such. Fine for backpack or glove compartment. Wonderfully organized for ease in tracking down species identification. Clear and exacting illustrations for each species. Up to the standerds of Sibley's excellent Guide to Birds. Incites one to hope for following up with guide to insects, to shells, to reptiles & amphibians etc. Strongly recommended to nature lovers, and anyone with some curiousity about their yards and forests"
        },
        {
            "title": "Sibley Guide to Trees",
            "text": "We have used the Sibley Bird Guide for years, and look forward to doing the same with the Guide to Trees."
        },
        {
            "title": "An excellent reference for identifying trees and the differences between the ...",
            "text": "An excellent reference for identifying trees and the differences between the species of the same genus. The illustrations are excellent."
        },
        {
            "title": "Beautiful!",
            "text": "Simply a gorgeous, wonderful resource. I loved the Sibley bird guides for years and now this is a favorite as well."
        },
        {
            "title": "No pictures of whole tree, except on cover",
            "text": "Description led me to believe the book would help me identify trees. Well, yes, if I can get close enough to see leaves etc....no pictures of the whole tree in this book."
        },
        {
            "title": "Pricey but worth every penny!",
            "text": "For the amateur tree hugger and the expert. This book is just great. Comprehensive and detailed yet easy to understand directions. Pictures are accurate and easy to understand in context. You won't be sorry that you have this wonderful guide!"
        },
        {
            "title": "not always complete",
            "text": "Some entries don't show what the whole tree looks like. I find I could not identify some trees, like the Modesto Ash."
        },
        {
            "title": "Beautiful Guide",
            "text": "The illustrations are wonderful. The introductions are very helpful and detailed. Each species has an illustration of leaf, trunk, tree shape, and flower/fruit in its various seasonal stages for easier identification at all times of the year!"
        },
        {
            "title": "Sibley Guide to Trees",
            "text": "Excellent field guide for the casual naturalist in North America. It covers urban exotics, native trees and trees found only in the tropics. Great for the traveler who enjoys nature and needs a quick identification. Not aimed at the seasoned arborist or dendrologist, but even we can learn from this guide how to show key identifying characters to the amateur."
        },
        {
            "title": "Disappointing",
            "text": "This is a disappointing book that lacks all the necessary info and pictures to help the beginner horticulturist or even experienced horticulturist identify trees. I have used this book in correlation a number of times in writing papers, and in the field and time and time again it fails me. Every time i intend to look for some specific info this book does not have it, and the pictures contained within are drawings of only a section of a tree. I promise you that - Allen J. Coombes book 'Trees' is a far superior book, and contains the necessary information for each tree."
        },
        {
            "title": "Good guide",
            "text": "It is very complete and helpful for doing tree identification. Pictures are very helpful and descriptions easy to follow. Helpful."
        },
        {
            "title": "Good tree guide",
            "text": "A awesome tree guide David Sibley is an incredible artist and this is guide is one of the main guides I refer to when trying to identify trees. One downside about the book however is the lack of an identification key. So you kinda haft to scan through the whole book till you find something similar to what your trying to identify. Other than that its a great tree book. No photograhs though but very detailed colored drawings."
        },
        {
            "title": "Worth it!",
            "text": "Excellent guide! Helps me in my quest to identify trees. Detailed illustrations as well as growth maps assist in identification."
        },
        {
            "title": "Sibley Guide to Trees",
            "text": "I think Sibley's tree guide will be a good reference. I wish there were profile paintings of every tree. And it would be more helpful if there were a key. Otherwise, the drawings of twigs, bark and leaves is very helpful."
        },
        {
            "title": "Used book purchase",
            "text": "Shipping and delivery were very prompt..condition was exactly as described. Excellent for everyday tree identification..I thought i might miss photographs but the drawings are better in some ways. Just the right amount of info and detail for me"
        },
        {
            "title": "This is my favorite tree ID book",
            "text": "The colored illustrations and native range maps are very helpful. This is my favorite tree ID book."
        },
        {
            "title": "A Tree Huggers Delight",
            "text": "Just the best Guide to the Urban and country Forest. Tree are a marvel of survival and beauty.The more we know the better we can do to keep them around us"
        },
        {
            "title": "Sibley's Trees",
            "text": "I never realized that there were so many different species of trees in North America! Same top quality information and graphics as in the bird guides."
        },
        {
            "title": "Simple format, great illustrations",
            "text": "The Sibley Guide to Trees has a great format that has worked so well in wild life guide books, pertinent illustrations and well written descriptions. It even has a check list in the back like a birding book. My only issue would be that the maps showing the range of the trees are very small and hard to use. But all in all, a great book that many people have picked up off my coffee table to browse."
        },
        {
            "title": "Good book for your reference collection.",
            "text": "Excellent resource for trees in America. Pictures are great along with maps for distribution. Index is comprehensive and easy to use."
        },
        {
            "title": "Best Ever Tree Identifier",
            "text": "Other reviews that don't give this a 5 seem to be done by jealous tree professionals. For the common user, this is the best ever. I especially like the images of each tree showing different seasonal stages. I have yet to have the book fail to ID the many trees I have on this 1,400 acre farm."
        },
        {
            "title": "great visual detail and information",
            "text": "The guide ..\"Sibley Guide to Trees\" , offers a well rounded and detailed understanding and learning of the vast world of trees."
        },
        {
            "title": "Five Stars",
            "text": "Came as promised - on time and in good condition."
        },
        {
            "title": "book",
            "text": "this is a decent book to help identify deciduous trees in my class. I would suggest this to others for tree id."
        },
        {
            "title": "This book is SO amazing. I love trees and have used several field ...",
            "text": "This book is SO amazing. I love trees and have used several field guides in the past that were pretty difficult to use. But this one was seriously a game- changer!! SO helpful and literally worth every penny. I am am amazed at the amount of useful information packed into this book. I love it! Definitely would recommend to everyone. (:"
        },
        {
            "title": "From a photographic perspective",
            "text": "I still like photographs, but the drawings are great and this book is going with me to into the forests!"
        },
        {
            "title": "A  happy owner of the new David Sibley book,  a Guide to Trees",
            "text": "This new book by David Sibley is a fine addition to our family. It's a gift to my husband, a serious birder, and it will help him and all of us be better informed re habitat for wildlife. He'd expressed interest in this because of the fine reviews it's had, and we knew the quality of David Sibley's work. I'm thankful Amazon made purchase of this so simple and at a reasonable price."
        },
        {
            "title": "Sibley Guide to Trees",
            "text": "An excellent and well organized reference book for the identification of trees. The illustrations are exceptional - from the overall appearance (habit) of the tree to the leaf descriptions. The color illustrations are plentiful and the color photography is exceptional."
        },
        {
            "title": "Amazing book. Very helpful",
            "text": "Amazing book. Very helpful. For quick reference and for leaf info I use this book and I compliment it with dirrs encyclopedia of trees and shrubs for more information. I highly recommend both."
        },
        {
            "title": "The best tree book available",
            "text": "This is the best tree book for the money available. A wealth of information with great photos. A must for anyone with an interest in trees."
        },
        {
            "title": "Sibley's giide to rees",
            "text": "A very useful book for a beginner naturalist as well as for the more experienced. Good illustrations and account of species."
        },
        {
            "title": "Great book, cover/binding disapointing",
            "text": "I love this book, however the binding looks as if the book was used, I almost sent it back. I realize I requested the flexible binding but the edges are bent there is something lodged in the backside cover which creates an annoying bump. I'm disappointed in the cover/binding of the book. Love Sibley's book however"
        },
        {
            "title": "Three Stars",
            "text": "Great production quality but no new information compared with many other guides."
        },
        {
            "title": "Sibley's Guide to Trees",
            "text": "Sibley's Guide to Trees is full of helpful information. I am looking forward to using it each season to help identify barks, leaves, shapes, and other characteristics of the many trees on our property. It is the only tree book that I have seen that goes into such detail, and the pictures are great."
        },
        {
            "title": "Tree Guide",
            "text": "I purchased this book for information on how to trim my trees. It was an excellent resource on types of trees and was overall excellent information on tree Identification."
        },
        {
            "title": "Great book for non-botanists",
            "text": "I got this book a couple of weeks ago, and I have used it extensively since then. I consider myself a naturalist, but I am not a botanist, and this book works wonderfully for me. It simplifies the language to a level I can easily understand."
        },
        {
            "title": "There were blank white stickers posted inside the cover and ...",
            "text": "There were blank white stickers posted inside the cover and the binding is a bit broken, but it still serves its purpose. If I could do it again, I would purchase a new copy of this book."
        },
        {
            "title": "Ho Hum",
            "text": "I guess this would be useful if you needed a quick guide to identify every tree in the continental US. Descriptions are very skimpy and they often feature 2 or even 3 trees per page. For me, this book was a waste of money. If you're not planning to visit all 48 states you would be much better served by buying a good regional guide. I live in Maine and I find Trees of the Northern United States And Canada is much more useful as they devote 2 full pages to each tree."
        },
        {
            "title": "Another Great Sibley",
            "text": "\"The Sibley Guide to Trees\" is a great book to read for someone who likes walking in the woods and enjoying nature."
        },
        {
            "title": "tree hugger",
            "text": "This is a fantastic book for young and old alike. Wish I had it when I was in grade school for that leaf project!"
        }
    ]
}